#Дни недели пронумерованы следующим образом: 0 — воскресенье, 1— понедельник, 2 — вторник, ..., 6 — суббота. Дано целое число K, лежащее в диапазоне1-365. Определить номер дня недели для K-го дня года, если известно, что в этом году 1января было понедельником.days = ["воскресенье", "понедельник", "вторник", "среда", "четверг", "пятница", "суббота"]
k = int(input("Введите номер дня года (от 1 до 365): "))

if 1 <= k <= 365:
    day_of_week = k % 7
    print(f"Номер дня недели: {day_of_week}")
else:
    print("Ошибка: число должно быть в диапазоне от 1 до 365.")










